import re
# import tushare as ts
string="""农林牧渔：新希望000876 温氏股份300498 
煤炭开采：中国神华601088 
钢铁行业：宝钢600019 
有色金属：中国铝业 山东黄金600547 
石油化工：中国石油601957 
基础化工：万华化学600309 恒力石化600346 
非金属类建材行业：海螺水泥600585 东方雨虹002271 
机械行业：三一重工600031 中国中车601766 
汽车和汽车零部件：上汽集团600104 
电子行业：京东方A 000725  海康威视002415 
通信行业：中国联通600050 中兴通讯000063 
计算机行业：三六零601360 
房地产：万科A 000002 
建筑和工程行业：中国建筑601668 
电力等公用事业行业：长江电力600900 
交通运输仓储行业：中国国航601111 顺丰控股002352 
食品饮料：贵州茅台600519 海天味业603288 
家电行业：美的集团000333 
医药生物行业：恒瑞医药600276 云南白药000538 
轻工造纸行业：欧派家具603833 
批发零售：永辉超市601933 苏宁易购002024 
社会服务业：中国国旅601888 
银行：工商银行601398
非银行金融：中国平安601318
"""


# def get_name(stock_code):
#     '''通过股票代码导出公司名称'''
#     pro = ts.pro_api()
#     dat = pro.query('stock_basic', fields='symbol,name')
#     company_name = list(dat.loc[dat['symbol'] == stock_code].name)[0]
#     return company_name
#
# print(get_name('000001'))
file_name=re.findall("([0-9]+)",string)
print(file_name)
# d={}
# for i in file_name:
#     d[i]=get_name(i)
# print(d)
